Revit 2027 API
BoundaryConditions.GetOrientTo Method
 Returns the boundary conditions orientation option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundaryConditionsOrientTo GetOrientTo()
Public Function GetOrientTo As BoundaryConditionsOrientTo
public:
BoundaryConditionsOrientTo GetOrientTo()
member GetOrientTo : unit -> BoundaryConditionsOrientTo
Return Value
BoundaryConditionsOrientTo
 The orientation option.
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace